# Используем легковесный образ Node.js
FROM node:22-alpine

# Создаем директорию приложения внутри контейнера
WORKDIR /usr/src/app

# Устанавливаем инструменты для компиляции нативных модулей (нужно для better-sqlite3)
RUN apk add --no-cache python3 make g++

# Копируем файлы с описанием зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем весь остальной исходный код
COPY . .

# Пробрасываем порт
EXPOSE 15002

# Команда для запуска релея
CMD ["node", "src/index.js"]